Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapDrawer
The Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapDrawer class enables the drawing of bitmaps for point handles.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapDrawer.drawnGraphics
The collection of all drawn graphics and their native handles.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapDrawer.bitmaps
The instance managing the loading of bitmaps.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapDrawer.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapDrawer class.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapDrawer.Draw(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleGraphic{Tekla.Common.Geometry.Vector3})
Draws a graphic for visualizationData.
visualizationData: The handle to draw a graphic for.
Returns: The drawn graphic.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapDrawer.DrawCursor(Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleGraphicDescription,System.Boolean)
Draws a graphic for cursor related graphicDescription.
graphicDescription: The type of handle graphic to get a bitmap for.
setCursor: The flag indicates to set or unset the cursor.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapDrawer.Remove(Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapGraphic)
Removes graphic from the view.
graphic: The graphic to remove.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapDrawer.DotExportConfigureCursorHandle(System.Int32,System.Boolean)
Configures the cursor with the bitmap associated to Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.BitmapIdentifier.
bitmapId: The bitmap identifier.
setCursor: The flag indicates to set or unset the cursor.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.HandleBitmapDrawer.Remove(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t)
Removes the graphic for handle from the view.
handle: The handle of the graphic to remove.